[
  {
    "id": "asgarnia",
    "name": "Asgarnia",
    "description": "The Kingdom of Asgarnia is one of the main kingdoms of Gielinor. Asgarnia's primary economic activities are crafting, mining, and fishing. It also has a notable navy based in Port Sarim.",
    "pets": [
      "Baby_mole",
      "Hellpuppy",
      "Nexling",
      "Pet_general_graardor",
      "Pet_k'ril_tsutsaroth",
      "Pet_kree'arra",
      "Pet_zilyana",
      "Wisp"
    ]
  },
  {
    "id": "desert",
    "name": "Desert",
    "description": "The Kharidian Desert is an expansive region located south of the nations of Misthalin and Morytania. The desert becomes a dangerous region south of the Shantay Pass, requiring travelers to drink from waterskins or other sources of water to avoid dehydration.",
    "pets": [
      "Abyssal_protector",
      "Kalphite_princess",
      "Lil'viathan",
      "Tiny_tempor",
      "Tumeken's_guardian"
    ]
  },
  {
    "id": "fremennik",
    "name": "Fremennik",
    "description": "The Fremennik Province is a region of various settlements ruled by the Fremennik and barbarians, found north of Kandarin. Besides the mainland, it includes many island settlements, due to the seafaring nature of the Fremennik.",
    "pets": [
      "Baron",
      "Muphin",
      "Pet_dagannoth_prime",
      "Pet_dagannoth_rex",
      "Pet_dagannoth_supreme",
      "Pet_rock",
      "Vorki"
    ]
  },
  {
    "id": "kandarin",
    "name": "Kandarin",
    "description": "Kandarin is one of the largest kingdoms in Gielinor ruled by King Lathas of East Ardougne. It encompasses most of the lands west of White Wolf Mountain. Kandarin is bordered by Asgarnia to the east, the Fremennik Province to the north, the forests of Tirannwn to the west, and the Feldip Hills to the south.",
    "pets": [
      "Broav",
      "Chompy_chick",
      "Fishbowl_(pet)",
      "Pet_kraken",
      "Pet_penance_queen",
      "Pet_smoke_devil"
    ]
  },
  {
    "id": "karamja",
    "name": "Karamja",
    "description": "Karamja is a large island in Gielinor. It is located to the south of the major kingdoms of Asgarnia and Kandarin. The island contains mostly jungle and tropical geography. Different tribes of Karamja speak different Karamjan languages.",
    "pets": [
      "Jal-nib-rek",
      "Tzrek-jad"
    ]
  },
  {
    "id": "kourend",
    "name": "Kourend",
    "description": "Great Kourend is a kingdom in the continent of Zeah, found far west of the mainland across the Western Sea. One of the largest kingdoms in Gielinor, it is larger than Misthalin and Asgarnia combined, and is similar in size to Kandarin.",
    "pets": [
      "Ikkle_hydra",
      "Olmlet",
      "Phoenix",
      "Skotos",
      "Sraracha"
    ]
  },
  {
    "id": "misthalin",
    "name": "Misthalin",
    "description": "Misthalin is a major kingdom within Gielinor, the most powerful human nation and by far the oldest. Its capital, Varrock, has existed in some form since soon after the end of the God Wars. It is divided in half by the River Lum, and its eastern border with Morytania is the River Salve.",
    "pets": [
      "Abyssal_orphan",
      "Cat",
      "Hellcat",
      "Herbi",
      "Lil'_creator",
      "Scurry"
    ]
  },
  {
    "id": "morytania",
    "name": "Morytania",
    "description": "Morytania is an area in the easternmost part of Gielinor. Often described as a land of evil, the land is filled with many aggressive creatures such as vampyres, werewolves, ghasts, and the undead. It is currently ruled by Lord Drakan.",
    "pets": [
      "Lil'_zik",
      "Little_nightmare",
      "Nid",
      "Noon"
    ]
  },
  {
    "id": "tirannwn",
    "name": "Tirannwn",
    "description": "Tirannwn is a heavily forested region located west of Kandarin. It is said that the elves retreated here after the God Wars. Apart from elves, there are rabbits, dire wolves, and grizzly bears that inhabit Tirannwn. The many traps and dense forest make travelling through Tirannwn difficult and potentially dangerous.",
    "pets": [
      "Pet_snakeling",
      "Smolcano",
      "Youngllef"
    ]
  },
  {
    "id": "varlamore",
    "name": "Varlamore",
    "description": "The Kingdom of Varlamore, also known as the Shining Kingdom, is a kingdom found in the continent of Zeah, far west of the mainland across the Western Sea. Like Great Kourend, it stands as one of the largest kingdoms in Gielinor, and one of the most distinct, given its isolation from the rest of the mainland.",
    "pets": [
      "Butch",
      "Huberte",
      "Moxi",
      "Quetzin",
      "Smol_heredit"
    ]
  },
  {
    "id": "wilderness",
    "name": "Wilderness",
    "description": "The Wilderness, also known as the Wild or Wildy, is a large and dangerous wasteland that makes up most of north-eastern Gielinor.",
    "pets": [
      "Callisto_cub",
      "Pet_chaos_elemental",
      "Pet_dark_core",
      "Prince_black_dragon",
      "Scorpia's_offspring",
      "Venenatis_spiderling",
      "Vet'ion_jr."
    ]
  }
]
